{"news_list":[{"story":"(Robert Krimen)++\n","time":"June 12th, 2008","title":"Jemplate-0.23 Released"},{"story":"Found and fixed a couple bugs in the 0.21 release.\n","time":"April 29th, 2008","title":"Jemplate-0.22 Released"},{"story":"Robert Krimen stepped up and largely overhauled Jemplate. It now\nhas builtin jQuery and YUI support. Ingy added a standalone\nJemplate compiler which means you don't need to install any Perl\nmodules to use Jemplate, now.\n","time":"April 28th, 2008","title":"Jemplate-0.21 Released"},{"story":"Fixed a couple platform specific test failures found in 0.19.\n","time":"November 22nd, 2006","title":"Jemplate-0.20 Released"},{"story":"The first jemplate release in over 6 months is now on <a\nhref=\"http://search.cpan.org\">CPAN</a> and\n<a href=\"http://www.openjsan.org\">JSAN</a>. This release has many bug\nfixes, allows template names to have paths, and has many more command\nline options, including --runtime, which writes out the Jemplate runtime\nmodule. Thanks to all who helped out!\n","time":"November 21st, 2006","title":"Jemplate-0.19 Released"},{"story":"<i>David Coffey</i> has created a site called\n<a href=\"http://atouchofglasss.com/\">A Touch of Glass</a> that is\ndone completely with Jemplate. This site used data exported from a\nYahoo! Store site as XML. He converted the XML to JSON and rendered\nthe whole schmear with Jemplate. Simply Brilliant.\n","time":"November 14th, 2006","title":"A Touch of Jemplate"}],"about_jemplate":"<p>JavaScript Templating is the best way to turn AJAX/JSON data into\nHTML. <b>Jemplate</b> is the best way to do JavaScript Templating.</p>\n\n<p><b>Jemplate</b> beats other JavaScript Templating frameworks hands\ndown for the following reasons:</p>\n\n<ul>\n<li>Jemplate is a complete port of the popular <a\nhref=\"http://www.template-toolkit.org/\">Template Toolkit</a> framework. This\nmeans it is very full featured indeed.</li>\n<li>Templates are precompiled (one time, on the server) as JavaScript functions. There is no JavaScript runtime penalty of compiling templates.</li>\n<li>Templates are <b>not</b> stored in your HTML. No silly tricks, like putting template code in hidden textareas.</li>\n<li>A browser downloads your templates once and caches them. Just like any other JavaScript code.</li>\n</ul>\n<p>This site is generated entirely by Jemplate. View Source to see for yourself.</p>\n<blockquote style=\"color: orange\">\n-- Ingy döt Net\n</blockquote>\n"}